cfd/OpenFOAM/incompressible/simpleFoam/05_Force_Coefs_3D/system/include/geometryRefinement
// near geometry refinement
nearGeometryRefinementDistance 0.5;
nearGeometryRefinementLevel 2;

// geometry surface refinement
surfaceRefinementLevelMin 2;
surfaceRefinementLevelMax 3;

// geometry features refinement
geometryFeaturesRefinementLevel 4;
