cfd/OpenFOAM/incompressible/simpleFoam/05_Force_Coefs_3D/system/include/referenceData
// reference data for force coefficient computations
referenceLength     0.64607;
referenceArea       1.5064;
