cfd/OpenFOAM/incompressible/simpleFoam/05_Force_Coefs_3D/system/include/relaxationFactors
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

// Relaxation factors
relaxationFactors_p         0.3;
relaxationFactors_U         0.5;
relaxationFactors_k         0.5;
relaxationFactors_omega     0.5;
relaxationFactors_epsilon   0.5;
